Naoki326/FramedPhoto/firmware/sdkconfig.defaults
# 目标芯片：ESP32-S3（好视达配套板）
CONFIG_IDF_TARGET="esp32s3"

# 基础配置
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash：16MB（配套板），双 OTA + storage 图片分区
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 调试
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# OTA 回滚：新固件首次启动须标记有效，否则 bootloader 自动切回旧分区
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# 主任务栈适当放大，便于后续 HTTP 拉取
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_WIFI_ENABLE_SMARTCONFIG=y

# 刷新按钮：按下立即拉取刷新（-1 = 禁用，默认禁用：休眠时易受干扰误触发）
CONFIG_FRAMEDPHOTO_BUTTON_GPIO=-1

# 服务端地址：mDNS 主机名（.local），服务端 IP 变化无需改配置
CONFIG_FRAMEDPHOTO_SERVER_URL="http://chenMac-mini.local:8010"
